Autodesk.Revit.DB.ElementWorksetFilter.#ctor(Autodesk.Revit.DB.WorksetId,System.Boolean)
Constructs a new instance of a filter to match elements in a given workset.
worksetId:
The workset id to match.
inverted:
True if the filter should match all elements which are not in the given workset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ElementWorksetFilter.#ctor(Autodesk.Revit.DB.WorksetId)
Constructs a new instance of a filter to match elements in a given workset.
worksetId:
The workset id to match.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012